[
  {
    "name": "Frank Franko",
    "rating": "5",
    "text": "Awesome job detailing my wife's Honda Pilot.  Easy scheduling and great communication.  Had it done while she was away for a few days and she was so happy and excited when she returned.  Exterior looks stunning and the interior now is not …"
  },
  {
    "name": "Steve Rice",
    "rating": "5",
    "text": "Joe did an incredible job! My car interior looks brand new!! I highly recommend 2Six Auto Detailing and I will certainly go back to them again."
  },
  {
    "name": "Lauren Leyton",
    "rating": "5",
    "text": "Joe is seriously INCREDIBLE. I should have taken before photos, my husband is a welder and we have 2 dogs that shed. The entire inside of his car was wrecked with oils, dirt, dog hair..list goes on. Joe vacuumed for 4 HOURS just to get the …"
  },
  {
    "name": "Ed Moyer",
    "rating": "5",
    "text": "I found Joe at 2Six through a Google search. I gave him my Chevy Traverse late morning and he had it finished by end of day. How he was able to get the car so clean in such a short amount of time is beyond me. The car shines brighter than …"
  },
  {
    "name": "Vimarsh",
    "rating": "5",
    "text": "Wow!  That’s all I can say… my car looks fantastic!  Joe did a phenomenal job with my car and I plan to keep him in business.  Hope he continues to have a passion for this work and maintain his work ethic and integrity throughout the …"
  },
  {
    "name": "Michael Sheehan",
    "rating": "5",
    "text": "First time ever that I took one of our cars to get detailed.  The result was nothing less that phenomenal!! The whole process of booking an appointment, dropping it off the night before and then getting a notice when to pick it up was so …"
  },
  {
    "name": "Aaron Marga",
    "rating": "5",
    "text": "An excellent job with our two vehicles. Exterior and interior were both done fantastically, for a very reasonable price. He is also a quick communicator. Will absolutely go back."
  },
  {
    "name": "scott miller",
    "rating": "5",
    "text": "Joe did incredible work. His shop is hands down the best I have ever been to. If your looking for a good detail use 2Six."
  },
  {
    "name": "Salzy Yordanova",
    "rating": "5",
    "text": "Absolutely great service! I am very picky about the cleanliness of my car and Joe did not disappoint. I highly recommend his service. He even stayed after his working hours to make sure …"
  },
  {
    "name": "Nick Webster",
    "rating": "5",
    "text": "Dropped my truck off with my paint being swirled and scratched from bumper to bumper, top to bottom. Picked it up, and my goodness does my truck look 1,000%  better. Joe is amazing. I love how my truck is looking. I 100% recommend him to everyone. Really nice guy and knows what he is talking about! Can’t wait to go back!!"
  },
  {
    "name": "Chad Acuna",
    "rating": "5",
    "text": "Awesome work! Very flexible on time and appointments. A must a go too for anything with detailing with your car."
  },
  {
    "name": "Ryan Kapp",
    "rating": "5",
    "text": "Joe does amazing work.  My wife’s SUV is used as a taxi for taking our kids up and down the east coast for sports.  Things can get pretty messy…and stinky for that matter. …"
  },
  {
    "name": "John Hunter",
    "rating": "5",
    "text": "I had my car done here and it is better than it came brand new from the dealer! I was amazed, I felt like I was driving a new and different car and it has 200,000 miles on it! Worth every penny! I would highly recommend the professional treatment you’ll receive at 2SIX!"
  },
  {
    "name": "Chris Shetzline",
    "rating": "5",
    "text": "Joe's work is incredible!!  Joe did a full detail on my 67 Mustang triple black convertible and the work was just amazing.  This is the best detail shop I have ever been to.  Outstanding work Joe.  I will be back soon with my Cobra."
  },
  {
    "name": "Jack Badger",
    "rating": "5",
    "text": "Grateful to Joe for making my first ever auto detailing experience a positive one. His professionalism, pride in his business & craft, and high end customer service were evident to me during our initial exchange and reinforced when I picked up my car. Would definitely return & recommend 2Six to friends and family!"
  },
  {
    "name": "Buzz Woods",
    "rating": "5",
    "text": "Joe did a stunning job on my Boxster!  I was MORE than pleased.  He’s reasonably priced and when it comes to his work…..well…..he’s very detail oriented!"
  },
  {
    "name": "Gracie DeSaro",
    "rating": "5",
    "text": "Joe was amazing and squeezed me in last minute! I got and interior detailing and he did a fantastic job even getting out a month old coffee stain!"
  },
  {
    "name": "Collin C",
    "rating": "5",
    "text": "This was the first time I ever got my car detailed since buying it in 2016. There was a ton of dirt and sand all over the car and now it looks brand new inside and out. Joe did a great job and you can tell he takes great pride in his work! Thank you and I’ll definitely be back!"
  },
  {
    "name": "Glenn Keenan",
    "rating": "5",
    "text": "Joey did a fantastic job on my 2018 Hyundai.  The car looks like it just came off the dealership floor!  Would definitely recommend 2Six Auto for all of your car detailing needs.  Easy to book online and my car was completed as scheduled.  I'll make sure to have Joey detail my car every year.  Thanks again Joey!"
  },
  {
    "name": "Amanda Kerrigan",
    "rating": "5",
    "text": "My car is 9 years old and Joe made the inside look new! He was friendly, punctual and very thorough! His communication was on point! He did the most amazing job and I would highly recommend him!"
  },
  {
    "name": "Christina F",
    "rating": "5",
    "text": "Brought my Benz in and I can say I WILL be a returning customer! My car was cleaner than when it left the dealership SOOO impressed! And his helper Kara was so friendly and kind. This is a hidden gem of a detail shop!"
  },
  {
    "name": "Michael Stolyar",
    "rating": "5",
    "text": "Took my wifes Mercedes SUV to 2Six Auto Detail...had lots of tree sap issues  and needed a total detail. Joe exceeded my expectations and did a beautiful job. SUV was perfect inside and out. Showroom condition! I'll definitely be back!"
  },
  {
    "name": "Kevin Delaney",
    "rating": "5",
    "text": "Joey really put in the work on my 9 year old van. It looked brand new. He brought back the shine to the faded clear coat. His work doesn’t disappoint."
  },
  {
    "name": "Daniel McDonald",
    "rating": "5",
    "text": "This place is highly recommended!! My TRX looks brand new and all the swirl marks removed. Very easy process and very reasonable pricing! Support local! They definitely go above and beyond. From now on, all my cars will be going here. THANK YOU!"
  },
  {
    "name": "Anthony Cinque",
    "rating": "5",
    "text": "I recently had my car detailed at this facility and Joe did an amazing job. I have a dog who sheds A LOT and there is not trace of hair in the car anymore. Pricing was extremely reasonable and the customer service and communication was incredible. I highly recommend bringing your vehicle here."
  },
  {
    "name": "Beechey Racing 173",
    "rating": "5",
    "text": "I just Purchased a 2022 Ram 1500 TRX, the factory paint on it was good, but it had love marks and swirls from the dealership doing an improper wash and detail. …"
  },
  {
    "name": "ray kenny",
    "rating": "5",
    "text": "I had my car, detailed, and ceramic coated. The communication was great. The service was great. The price was great. I highly recommend for your detailing and ceramic coating. I am so pleased that I am going to bring another vehicle there for the same services."
  },
  {
    "name": "Caryn Glenwright",
    "rating": "5",
    "text": "Had Joe detail my dads suv which has not been detailed in years and “OH MY” what Joe did was amazing!!! The vehicle actually shines now. Joe removed all the scratches and made the interior spotless! I would highly recommend 2six auto detailing!! Thanks Joe!"
  },
  {
    "name": "Tijoy Thomas",
    "rating": "5",
    "text": "Smooth experience with 2Six. Was able to see prices online and book online as well with ease. Joe met me on time and kept me in the loop on when the car would be ready. Definitely planning on using 2Six again and would recommend their services!"
  },
  {
    "name": "Maggie Zawatski",
    "rating": "5",
    "text": "Excellent service! Joe is a professional in all senses of the word. My vehicle truly looks like it just came off the lot. Highly recommend 2Six for all of your cosmetic needs!"
  },
  {
    "name": "Joseph Nonnamaker",
    "rating": "5",
    "text": "My car came out looking brand new. Had the interior done and every inch of it is spotless. They take their time in doing your car and it is well worth it. Could not be any happier with the end result."
  },
  {
    "name": "Daniel Azeff",
    "rating": "5",
    "text": "Another fabulous job by 2 Six Auto Detail! I brought my wife's Porsche Panamera last week and my Cayenne today. Like brand new! Joe was professional and took extra time to do a perfect job!"
  },
  {
    "name": "Kristine Kilcoyne",
    "rating": "5",
    "text": "I will never go to another detailer. Joe is kind, knowledgeable and runs a great business."
  },
  {
    "name": "Andrea Cover",
    "rating": "5",
    "text": "Amazing job! My car was spotless when I picked it up.  I'm making appointments to get my other cars detailed as well! Highly recommend!"
  },
  {
    "name": "BAZ Mill",
    "rating": "5",
    "text": "Joe at 2six is no joke. Had my car for the day and he did his thing. Thee best detailer I've ever used. Definitely go check him out. If you have any doubts look him up on Instagram. You will not be disappointed."
  },
  {
    "name": "donna maggeo",
    "rating": "5",
    "text": "Unbelievable work! Honest, top notch detail shop! Took my car and brought a new one back!  Definitely HIGHLY recommend this place! KUDOS!!!"
  },
  {
    "name": "Patrick Heasley",
    "rating": "5",
    "text": "Just moved to the area and found my new detailing spot. My vehicle looks as good as the day I bought it."
  },
  {
    "name": "Juliana Mahovlic",
    "rating": "5",
    "text": "This is the first time I’ve ever had my car detailed and it was way better than I anticipated. Thank you so much for your hard work Joe!"
  },
  {
    "name": "Jenna Singer",
    "rating": "5",
    "text": "Joey did such a great job detailing my car it felt brand new when I picked it back up. You can tell he really takes his time!"
  },
  {
    "name": "Sheree Richman",
    "rating": "5",
    "text": "WOW! WOW! WOW! I have had many cars detailed by many businesses over the years, but I have never been this happy with the results. My car is 7 years old and looks like I just drove it off the showroom floor! Thank you, Joe!!"
  },
  {
    "name": "Fabrizio Catoni",
    "rating": "5",
    "text": "Just picked up my truck after having it detailed by Joe.  To say it turned out awesome is an understatement.  Outstanding job and will be highly recommended."
  },
  {
    "name": "Jeff Keenan",
    "rating": "5",
    "text": "A fabulous job on my Maserati! No more car washes for me...a quick wash and vacuum every week is now on my schedule! Thanks Joe...great job!"
  },
  {
    "name": "Kevin Charyszyn",
    "rating": "5",
    "text": "The best my car has looked in years! Definitely recommend and will be back myself! Awesome work…thanks Joe!!"
  },
  {
    "name": "Olena Berchuk",
    "rating": "5",
    "text": "This was my first time getting my car detailed and wow, I'll definitely be back! I haven't seen my car this spotless in a long time and for such a reasonable price too!"
  },
  {
    "name": "Bobby Gidfings",
    "rating": "5",
    "text": "Just an Amazing job! Recommend  the Ceramic Spray add on...my car is SHINING!I will be back with my wife's  car. 2Six ...Highly Recommend!"
  },
  {
    "name": "Bill Cupo",
    "rating": "5",
    "text": "Car looks better than showroom new. Fantastic job on a glossy black CRV. Outstanding service"
  },
  {
    "name": "Chad Wiener",
    "rating": "5",
    "text": "Amazing work on 2 of my cars."
  },
  {
    "name": "Jessica Jones",
    "rating": "5",
    "text": "My husband got my car detailed at 2 Six and it was nothing short of perfect.  They made my 2010 car look brand new. They will get all our cars eventually 😊 …"
  },
  {
    "name": "Kevin Gay",
    "rating": "5",
    "text": "Incredible customer service and a job well done. Will continue to bring my car back here every time I need detailing."
  },
  {
    "name": "Dave Difiore",
    "rating": "5",
    "text": "Absolutely impeccable and the done on time. Car never looked as good. It actually seems like it runs better and sounds better than it ever did before I’m pretty particular, and this met all of the points. …"
  },
  {
    "name": "Dylan Ashbach",
    "rating": "5",
    "text": "Super happy with my experience, great guy, fair price, couldn't recommend more."
  },
  {
    "name": "Anthony Moore",
    "rating": "5",
    "text": "Great company. Made my work truck look brand new. Highly recommend"
  },
  {
    "name": "Laramie Dunlap",
    "rating": "5",
    "text": "Could not be more happy with it. Like a brand new car"
  },
  {
    "name": "Raymond Dasch",
    "rating": "5",
    "text": "Joe did an excellent detail on my 2018 Tahoe; looked showroom new!"
  },
  {
    "name": "gary Auerbach",
    "rating": "5",
    "text": "Joe was professional, courteous and did an incredible job. I highly recommend his services to everyone!!!!"
  },
  {
    "name": "Timothy McGuigan",
    "rating": "5",
    "text": "The Camaro. Turned  out awesome  thankyou  so much for taking  care of me like family. Thank you sir"
  },
  {
    "name": "Jack PixL",
    "rating": "5",
    "text": "Best service, will be coming back frequently."
  },
  {
    "name": "Brian Belcher",
    "rating": "5",
    "text": "Really cool guy, excellent work with wonderful customer service!"
  },
  {
    "name": "Damiano Consilvio",
    "rating": "5",
    "text": "Honest reliable professional service, certainly knows how to earn a customer for life"
  },
  {
    "name": "Kathy Aylmer",
    "rating": "5",
    "text": "Extremely friendly, talented and generous young man."
  },
  {
    "name": "Jose chavez",
    "rating": "5",
    "text": "Very good service, nice and good at there job 100% recommend here"
  },
  {
    "name": "ROBERT ALLEN",
    "rating": "5",
    "text": ""
  },
  {
    "name": "Joey Keenan",
    "rating": "5",
    "text": ""
  },
  {
    "name": "Joe C",
    "rating": "5",
    "text": ""
  },
  {
    "name": "Alex Nalbandian",
    "rating": "5",
    "text": "Thank you!"
  }
]